#set WDIR /home/unga/sglee/Share/ac_hw_syn
set WDIR ~/behzad_local/verilog_files/synthesis
set RTLDIR ~/behzad_local/verilog_files/apx_operators/int_ops_apx
set REPORTS_DIR ${WDIR}/reports
set DESIGN_NAME config_int_add_clkGate_DATA_PATH_BITWIDTH32_CLKGATED_BITWIDTH16 
set saif_file_name config-int-add-clkGate__tb.saif

set RESULTS_DIR ${WDIR}/results
set DCRM_FINAL_TIMING_REPORT timing.rpt
set DCRM_FINAL_AREA_REPORT area.rpt
set DCRM_FINAL_POWER_REPORT power.rpt
set search_path "${RTLDIR}"

set syn_dir_addr "/home/polaris/behzad/behzad_local/verilog_files/apx_operators/int_ops_apx/build/syn/results"
set synthesized_design_name "config_int_add_clkGate_16clkGatedBits_synthesized" 
set synthesized_design_file ${synthesized_design_name}.v 
set sim-res_dir "/home/polaris/behzad/behzad_local/verilog_files/apx_operators/int_ops_apx/build/gate_level_sim"
 
#/* Top-level Module     */
set my_toplevel ${DESIGN_NAME}
#set lib_dir_1 "/usr/local/packages/synopsys_32.28_07292013/SAED32_EDK/lib"
#set lib_dir "/home/polaris/behzad/behzad_local/verilog_files/libraries/germany_NanGate/db"
set lib_dir_2 "/home/polaris/behzad/behzad_local/verilog_files/libraries"
#set lib_dir_3 "/home/polaris/behzad/behzad_local/verilog_files/libraries/FreePDK45/osu_soc/lib/files"


set CLKGATED_BITWIDTH 16; #operator bitwidth
set DATA_PATH_BITWIDTH 32; #flipflop bitwidth



#--- NOTE: I had to include *_rvt as well, cause ow the compiler was erroring out
#set search_path [concat  $search_path $lib_dir_1/stdcell_rvt/db_nldm $lib_dir_1/stdcell_lvt/db_nldm $lib_dir_2/germany_NanGate/db $lib_dir_3]
set search_path [concat  $search_path $lib_dir_2/germany_NanGate/db]


#source ${WDIR}/lib_list.txt

#set std_library "saed32rvt_tt1p05v25c.db"
#set std_library "saed32lvt_tt1p05v25c.db"; #the best(amon lvts)
#set std_library "saed32lvt_tt1p05vn40c.db"; #did the same as 25c 
#set std_library "saed32lvt_tt0p85v25c.db"; #did worst that 1.05
#set  std_library  "saed32lvt_ulvl_ff1p16v25c_i0p85v.db" 
set  std_library  "noAging.db" 
#set std_library "gscl45nm.db"; #PDK45 themselves

set target_library $std_library; #$std_library_2" 
set link_library $std_library; #$std_library_2"


#--- specifying libraries 
#define_design_lib WORK -path ./WORK
set power_enable_analysis "true"
read_verilog  ${syn_dir_addr}/blah.v 
read_verilog ${syn_dir_addr}/${synthesized_design_file}
#"/home/polaris/behzad/behzad_local/verilog_files/synthesis/results/unconfig_int_add_32Bit_32Bit_synthesized.v"

current_design ${my_toplevel}
link
# Averaged mode power analysis uses the saif format. Read the parasitics # generated by IC Compiler before you run report_power.
set power_analysis_mode "averaged" 
read_saif ${sim-res_dir}/${saif_file_name} -strip_path test_bench_tb/apx_add_clkGate 

#report_switching_activity -list_not_annotated 
#pt_shell> report_power -verbose -hierarchy

report_power > ${REPORTS_DIR}/${DESIGN_NAME}_${CLKGATED_BITWIDTH}clkGatedBits_power.rpt
report_power -verbose -hierarchy >  ${REPORTS_DIR}/${DESIGN_NAME}_${CLKGATED_BITWIDTH}clkGatedBits_power_with_saif.rpt
remove_design -hierarchy
exit
